docs/presentations/kubecon-2020-north-america.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Contributing to Kubernetes Conformance Coverage</title>
<meta name="author" content="ii.coop"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/css/reveal.css"/>

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/css/theme/moon.css" id="theme"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/lib/css/zenburn.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Contributing to Kubernetes Conformance Coverage</h1><h2 class="author">ii.coop</h2><p class="date">Created: 2020-10-20 Tue 17:04</p>
</section>

<section>
<section id="slide-org0f815a0">
<h2 id="org0f815a0">About ii</h2>
<div class="outline-text-2" id="text-org0f815a0">
</div>
</section>
</section>
<section>
<section id="slide-orga22482a">
<h3 id="orga22482a">ii.coop</h3>

</section>
</section>
<section>
<section id="slide-org2dda864">
<h3 id="org2dda864">Hippie Hacker</h3>

</section>
</section>
<section>
<section id="slide-orgdef2b65">
<h3 id="orgdef2b65">Caleb Woodbine</h3>

</section>
</section>
<section>
<section id="slide-org344f84a">
<h2 id="org344f84a">Intro</h2>
<div class="outline-text-2" id="text-org344f84a">
</div>
</section>
</section>
<section>
<section id="slide-org3245f53">
<h3 id="org3245f53">What is Kubernetes Conformance?</h3>
<p>
CNCF Kubernetes Conformance ensures
</p>

<blockquote>
<p>
&#x2026; that every vendor’s version of Kubernetes supports the required APIs, as do open source community versions
</p>
</blockquote>

<ul>
<li><a href="https://cncf.io/ck">https://cncf.io/ck</a></li>
<li><a href="https://github.com/cncf/k8s-conformance">https://github.com/cncf/k8s-conformance</a></li>

</ul>

</section>
</section>
<section>
<section id="slide-org70f5f1e">
<h3 id="org70f5f1e">Why is Kubernetes Conformance important?</h3>
<p>
Conformance with Kubernetes ensures:
</p>

<ul>
<li>portability workloads
<ul>
<li>stable APIs behave the same everywhere</li>

</ul></li>
<li>freedom from vendor lock-in
<ul>
<li>consistency with APIs</li>

</ul></li>

</ul>

</section>
<section id="slide-orgf4122b9">
<h4 id="orgf4122b9">How many Kubernetes Distributions are Certified?</h4>
<p>
Currently, there are 70 certified distributions.
</p>

<ul>
<li><a href="https://landscape.cncf.io/category=platform&amp;format=card-mode&amp;grouping=category">landscape.cncf.io</a></li>

</ul>

<p>
Click <b>Certified K8s/KCSP/KTP</b> link on the left
</p>
</section>
</section>
<section>
<section id="slide-org933d70b">
<h3 id="org933d70b">How do I certify/verify a distribution?</h3>
<div class="outline-text-3" id="text-org933d70b">
</div>
</section>
<section id="slide-orgd7166c2">
<h4 id="orgd7166c2">Creating your Conformance Submission</h4>
<p>
<a href="https://github.com/cncf/k8s-conformance/blob/master/instructions.md">cncf/k8s-conformance /instructions.md</a>
</p>

<pre class="example">
vX.Y/$dir/README.md: how to reproduce your results.
vX.Y/$dir/e2e.log: Test log output (from Sonobuoy).
vX.Y/$dir/junit_01.xml: Machine-readable test log (from Sonobuoy).
vX.Y/$dir/PRODUCT.yaml: Details of your PRODUCT
</pre>

</section>
<section id="slide-orge7c84ef">
<h4 id="orge7c84ef">Document How to Bring test your cluster</h4>
<p>
Example <b>README.md</b> with instructions:
</p>

<p>
<a href="https://github.com/cncf/k8s-conformance/tree/master/v1.18/kind">cncf/k8s-conformance/tree/master/v1.18/kind</a>
</p>

<div class="org-src-container">

<pre><code class=" tmate" >time ./kind-run.sh 1.18.0
</code></pre>
</div>

</section>
<section id="slide-org3390cad">
<h4 id="org3390cad">Watch Sonobuoy</h4>
<div class="org-src-container">

<pre><code class=" tmate" >watch kubectl get all --all-namespaces
</code></pre>
</div>
</section>
<section id="slide-orga028ac5">
<h4 id="orga028ac5">Sonobuoy Logs</h4>
<div class="org-src-container">

<pre><code class=" tmate" >sonobuoy logs -f
</code></pre>
</div>
</section>
<section id="slide-org46d87d4">
<h4 id="org46d87d4">Sonobuoy Results</h4>
<div class="org-src-container">

<pre><code class=" tmate" >find v1.*/plugins/e2e/results/global
</code></pre>
</div>

<pre class="example">
v1.18.0_2020-10-20_14:34.00/plugins/e2e/results/global
v1.18.0_2020-10-20_14:34.00/plugins/e2e/results/global/junit_01.xml
v1.18.0_2020-10-20_14:34.00/plugins/e2e/results/global/e2e.log
</pre>
</section>
<section id="slide-org013b762">
<h4 id="org013b762">Create cncf/k8s-conformance PR</h4>
<div class="outline-text-4" id="text-org013b762">
</div>
<ul class="org-ul">
<li><a id="org4ae7b73"></a>Fork+Branch+Remote<br />
<div class="org-src-container">

<pre><code class=" tmate" >git clone https://github.com/cncf/k8s-conformance
cd k8s-conformance
git remote add ii git@github.com:ii/k8s-conformance
git checkout -b notkind-v1.18
</code></pre>
</div>
</li>
<li><a id="org101e529"></a>Copy results into place<br />
<div class="org-src-container">

<pre><code class=" tmate" >cp -a ../notkind v1.18/notkind
cp -a ../v1.*/plugins/e2e/results/global/* v1.18/notkind
</code></pre>
</div>
</li>
<li><a id="org07e83ae"></a>Commit and Push Results<br />
<div class="org-src-container">

<pre><code class=" tmate" >git add v1.18/notkind
git commit -m 'Conformance results for v1.18/notkind'
git push ii notkind-v1.18
</code></pre>
</div>
</li>
</ul>




</section>
</section>
<section>
<section id="slide-org792798f">
<h2 id="org792798f">Identifying Gaps in Kubernetes Conformance Coverage</h2>
<div class="outline-text-2" id="text-org792798f">
</div>
</section>
</section>
<section>
<section id="slide-org0c7c20c">
<h3 id="org0c7c20c">Loading K8s API into SQL</h3>
<ul>
<li>SnoopDB loads the OpenAPI swagger.json</li>
<li>Enables queries of K8s API definition</li>
<li>Helps to understand the shape of kubernetes</li>

</ul>

</section>
</section>
<section>
<section id="slide-org4c09a91">
<h3 id="org4c09a91">Loading CI logs into SQL</h3>
<ul>
<li>SnoopDB loads recent CI audit logs</li>
<li>Enables queries of K8s API usage</li>
<li>Helps understand what we are testing</li>

</ul>

</section>
</section>
<section>
<section id="slide-org04fe482">
<h3 id="org04fe482">e2e.test framework support</h3>
<ul>
<li>UserAgent updated to include test name</li>
<li>AuditLogs include test and operation</li>

</ul>

</section>
</section>
<section>
<section id="slide-org4225306">
<h3 id="org4225306">Query Gaps in Conformance Coverage</h3>
<ul>
<li>Compare Operations hit by [Conformance]</li>
<li>Query untested surface area</li>

</ul>

</section>
</section>
<section>
<section id="slide-org48b929e">
<h3 id="org48b929e">Visualize Data</h3>

</section>
</section>
<section>
<section id="slide-org60a97b7">
<h2 id="org60a97b7">Closing Gaps in Kubernetes Conformance Coverage</h2>
<p>
APISnoop + AuditSink + Test writing
</p>
</section>
</section>
<section>
<section id="slide-org66a059f">
<h3 id="org66a059f">Auditing the OpenAPI</h3>
<ul>
<li>APIServer can be configured to log usage</li>
<li>Combining an AuditPolicy and AuditSink</li>
<li>Usage is logged into SnoopDB in a cluster</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgc5130f6">
<h3 id="orgc5130f6">SnoopDB in cluster</h3>
<ul>
<li>Identify in Cluster Usage</li>
<li>Focus on hitting Gaps in API</li>

</ul>
</section>
</section>
<section>
<section id="slide-org0bfb5bf">
<h3 id="org0bfb5bf">MockTest Demo</h3>

</section>
</section>
<section>
<section id="slide-org0bcc9df">
<h2 id="org0bcc9df">Preventing gaps in Kubernetes Conformance Coverage</h2>
<p>
prow.cncf.io
**
</p>

</section>
</section>
<section>
<section id="slide-orgb55dc1e">
<h2 id="orgb55dc1e">Verifying Cloud Provider Submission</h2>
<p>
prow.cncf.io
</p>

<p>
For every vendor and distribution to be marked as official, tests must be run against the Kubernetes cluster to verify it's APIs behave in a given way per the test.
</p>
</div>
</div>
<script src="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/lib/js/head.min.js"></script>
<script src="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/js/reveal.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,

overview: true,
margin: 0.10,
minScale: 0.20,
maxScale: 3.50,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'cube', // see README of reveal.js for options
transitionSpeed: '1',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: 'https://reveal-js-multiplex-ccjbegmaii.now.sh' // Location of socket.io server
},

// Optional libraries used to extend reveal.js
dependencies: [
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: 'https://cdn.socket.io/socket.io-1.3.5.js', async: true },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/multiplex/master.js', async: true }]

});
</script>
</body>
</html>
